000001 IDENTIFICATION
000002 PROGRAM-ID. "BMICALCULATOR".
000003 AUTHOR.  WES MCKNIGHT.
000004*This program reads input from the user
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION.
000009 01 WEIGHT PIC 999.
000010 01 HEIGHT_INCHES PIC 999.
000011 01 BMI PIC 999V99.
000012
000013 PROCEDURE DIVISION.
000014 0100-START-HERE.
000015
000016 STOP RUN.
000017 END PROGRAM BMICALCULATOR.