000001 IDENTIFICATION DIVISION. 
000002 PROGRAM-ID. "HELLO WORLD".
000003 AUTHOR. WES MCKNIGHT.
000004*THIS IS A COMMENT IN COBOL
000005*COLUMNS 8-11 A MARGIN
000006*COLUMNS 12-72 B MARGIN
000007 ENVIRONMENT DIVISION.
000008
000009 DATA DIVISION.
000010 
000011 PROCEDURE DIVISION.
000012 0100-START-HERE.
000013      DISPLAY "HELLO WORLD!".
000014 DISPLAY "HOWDY! I'M LEARNING HOW TO PROGRAM COBOL!"
000015 STOP RUN.
000016 END PROGRAM HELLOWORLD. 