000100 IDENTIFICATION DIVISION. 
000200 PROGRAM-ID. 
000300 DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 WS-NAME PIC A(6) VALUE IS 'Wes'.

       PROCEDURE DIVISION.
           DISPLAY "Hello: "WS-NAME.

       STOP RUN.