000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "OBTAININPUT"
000003 AUTHOR. WES MCKNIGHT
000004*This is a comment in COBOL
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION.
000009 01 NAME PIC A(20).
000010
000011 PROCEDURE DIVISION.
000012
000013 PROCEDURE DIVISION.
000014     0100-START-HERE.
000015         DISPLAY "Please enter your name: ".
000016         ACCEPT NAME.
000017         DISPLAY "It is nice to meet you, ", NAME.
000018 STOP RUN.
000019 END PROGRAM OBTAININPUT.