       IDENTIFICATION DIVISION.
       PROGRAM-ID. "OBTAININPUT".
       AUTHOR. WES MCKNIGHT
      *This is a comment in COBOL
       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.

       PROCEDURE DIVISION.
           0100-START-HERE.
               DISPLAY "Hello World!".
       STOP RUN.
       END PROGRAM OBTAININPUT.